Repository: thachpn165/cloudflare-r2-offload-cdn
Catalog: languages/cloudflare-r2-offload-cdn-*.po
Languages: vi

source: This plugin is an independent, third-party project and is not affiliated with, endorsed by, or officially associated with Cloudflare, Inc. "Cloudflare" and "R2" are trademarks of Cloudflare, Inc. The use of these names is solely for descriptive purposes to indicate compatibility with Cloudflare services.
vi: Plugin này là một dự án độc lập của bên thứ ba và không liên kết, được chứng thực hoặc liên quan chính thức với Cloudflare, Inc. "Cloudflare" và "R2" là nhãn hiệu của Cloudflare, Inc. Việc sử dụng các tên này chỉ nhằm mục đích mô tả để chỉ ra khả năng tương thích với các dịch vụ của Cloudflare.
