Repository: thachpn165/cloudflare-r2-offload-cdn
Catalog: languages/cloudflare-r2-offload-cdn-*.po
Languages: vi

source: CF R2 Offload & CDN
vi: CloudFlare R2 Offload & CDN

source: CF R2 Offload & CDN Settings
vi: Cài đặt CloudFlare R2 Offload & CDN

source: Dashboard
vi: Bảng điều khiển

source: Setup Guides
vi: Hướng dẫn cài đặt

source: 1. Create R2 Bucket
vi: 1. Tạo R2 Bucket

source: 2. Create Cloudflare API Token
vi: 2. Tạo API Token Cloudflare

source: 3. Configure CDN URL
vi: 3. Cấu hình URL CDN

source: 4. Offload Media to R2
vi: 4. Chuyển Media lên R2

source: 5. Image Optimization Settings
vi: 5. Cài đặt tối ưu hình ảnh

source: Log in to <a href="https://dash.cloudflare.com" target="_blank">Cloudflare Dashboard</a>
vi: Đăng nhập vào <a href="https://dash.cloudflare.com" target="_blank">Cloudflare Dashboard</a>

source: Go to <strong>R2 Object Storage</strong> in the left sidebar
vi: Vào <strong>R2 Object Storage</strong> trong thanh bên trái

source: Click <strong>Create bucket</strong>
vi: Nhấn <strong>Create bucket</strong>

source: Enter bucket name (e.g., <code>my-wp-media</code>) and select location
vi: Nhập tên bucket (ví dụ: <code>my-wp-media</code>) và chọn vị trí

source: Click <strong>Create bucket</strong> to finish
vi: Nhấn <strong>Create bucket</strong> để hoàn tất

source: Your Account ID is shown at the top right of the R2 page.
vi: Account ID hiển thị ở góc trên bên phải trang R2.

source: In R2 page, click <strong>Manage R2 API Tokens</strong>
vi: Trong trang R2, nhấn <strong>Manage R2 API Tokens</strong>

source: Click <strong>Create API token</strong>
vi: Nhấn <strong>Create API token</strong>

source: Set permissions: <strong>Object Read & Write</strong>
vi: Đặt quyền: <strong>Object Read & Write</strong>

source: Specify bucket (or all buckets)
vi: Chỉ định bucket (hoặc tất cả buckets)

source: Click <strong>Create Token</strong>
vi: Nhấn <strong>Create Token</strong>

source: Copy <strong>Access Key ID</strong> and <strong>Secret Access Key</strong>
vi: Sao chép <strong>Access Key ID</strong> và <strong>Secret Access Key</strong>

source: In R2 bucket settings, go to <strong>Settings</strong> tab
vi: Trong cài đặt bucket R2, vào tab <strong>Settings</strong>

source: How to enable public access →
vi: Cách bật truy cập công khai →

source: Enter the CDN URL in the CDN tab (e.g., https://cdn.yourdomain.com)
vi: Nhập URL CDN trong tab CDN (ví dụ: https://cdn.yourdomain.com)

source: Automatic Offload:
vi: Tự động chuyển:

source: Enable <strong>Auto Offload</strong> in Offload tab
vi: Bật <strong>Tự động chuyển</strong> trong tab Offload

source: New uploads will be automatically offloaded to R2
vi: Các tệp tải lên mới sẽ tự động được chuyển lên R2

source: Manual Offload:
vi: Chuyển thủ công:

source: In Media Library, click <strong>Offload to R2</strong> for individual items
vi: Trong Thư viện Media, nhấn <strong>Chuyển lên R2</strong> cho từng mục

source: Or use attachment edit page for single file offload
vi: Hoặc dùng trang chỉnh sửa để chuyển từng tệp

source: Bulk Offload Existing Media:
vi: Chuyển hàng loạt Media hiện có:

source: Go to <strong>Bulk Actions</strong> tab
vi: Vào tab <strong>Bulk Actions</strong>

source: Set batch size (25-50 recommended)
vi: Đặt kích thước batch (khuyến nghị 25-50)

source: Click <strong>Start Bulk Offload</strong>
vi: Nhấn <strong>Bắt đầu chuyển hàng loạt</strong>

source: Wait for completion (you can cancel anytime)
vi: Đợi hoàn thành (có thể hủy bất cứ lúc nào)

source: Configure image optimization in the <strong>CDN</strong> tab:
vi: Cấu hình tối ưu hình ảnh trong tab <strong>CDN</strong>:

source: Deploy Worker first (see step 4)
vi: Triển khai Worker trước (xem bước 4)

source: Cost Information:
vi: Thông tin chi phí:

source: R2 Storage: $0.015/GB/month
vi: Lưu trữ R2: $0.015/GB/tháng

source: R2 Class A Operations (write): $4.50/million
vi: Thao tác R2 Class A (ghi): $4.50/triệu

source: R2 Class B Operations (read): $0.36/million
vi: Thao tác R2 Class B (đọc): $0.36/triệu

source: Image Transformations: First 5,000/month free, then $0.50/1,000
vi: Chuyển đổi hình ảnh: 5.000 lần/tháng miễn phí, sau đó $0.50/1.000

source: Monitor usage in Worker Statistics above and Cloudflare Dashboard.
vi: Theo dõi sử dụng trong Worker Statistics ở trên và Cloudflare Dashboard.

source: Quick Stats
vi: Thống kê nhanh

source: Total Media
vi: Tổng Media

source: Local
vi: Cục bộ

source: Offloaded
vi: Đã chuyển

source: Pending
vi: Đang chờ

source: Worker Statistics
vi: Thống kê Worker

source: Requests This Month
vi: Yêu cầu tháng này

source: View detailed analytics in your <a href="%s" target="_blank" rel="noopener">Cloudflare Dashboard</a>
vi: Xem phân tích chi tiết trong <a href="%s" target="_blank" rel="noopener">Cloudflare Dashboard</a>

source: Deploy the Worker to see analytics.
vi: Triển khai Worker để xem phân tích.

source: System Status
vi: Trạng thái hệ thống

source: R2 Credentials
vi: Thông tin R2

source: Configured
vi: Đã cấu hình

source: Not configured
vi: Chưa cấu hình

source: CDN Status
vi: Trạng thái CDN

source: Enabled
vi: Đã bật

source: Disabled
vi: Đã tắt

source: Worker Status
vi: Trạng thái Worker

source: Deployed
vi: Đã triển khai

source: Not deployed
vi: Chưa triển khai

source: Storage
vi: Lưu trữ

source: R2 Storage Configuration
vi: Cấu hình lưu trữ R2

source: Configure your Cloudflare R2 storage credentials. Get these from Cloudflare Dashboard > R2 > Manage R2 API Tokens.
vi: Cấu hình thông tin lưu trữ Cloudflare R2. Lấy từ Cloudflare Dashboard > R2 > Manage R2 API Tokens.

source: Get R2 API Credentials:
vi: Lấy thông tin API R2:

source: Go to <a href="https://dash.cloudflare.com/profile/api-tokens" target="_blank">API Tokens</a> page
vi: Vào trang <a href="https://dash.cloudflare.com/profile/api-tokens" target="_blank">API Tokens</a>

source: Select <strong>Create Custom Token</strong>
vi: Chọn <strong>Create Custom Token</strong>

source: Add the following permissions:
vi: Thêm các quyền sau:

source: Permission
vi: Quyền

source: Access
vi: Truy cập

source: Purpose
vi: Mục đích

source: Click <strong>Continue to summary</strong> > <strong>Create Token</strong>
vi: Nhấn <strong>Continue to summary</strong> > <strong>Create Token</strong>

source: Copy the token (shown only once!)
vi: Sao chép token (chỉ hiển thị một lần!)

source: Your Cloudflare account ID (alphanumeric).
vi: Cloudflare Account ID của bạn (chữ và số).

source: R2 Access Key ID from API token.
vi: R2 Access Key ID từ API token.

source: R2 Secret Access Key (encrypted in database). Leave blank to keep existing value.
vi: R2 Secret Access Key (được mã hóa trong database). Để trống để giữ giá trị hiện tại.

source: Bucket Name
vi: Tên Bucket

source: R2 bucket name (lowercase alphanumeric and hyphens only).
vi: Tên bucket R2 (chỉ chữ thường, số và dấu gạch ngang).

source: Connection Test
vi: Kiểm tra kết nối

source: Test Connection
vi: Thử kết nối

source: Verify R2 credentials by testing connection.
vi: Xác minh thông tin R2 bằng cách thử kết nối.

source: Save Settings
vi: Lưu cài đặt

source: CDN Configuration
vi: Cấu hình CDN

source: Configure CDN URL rewriting and image optimization settings.
vi: Cấu hình viết lại URL CDN và cài đặt tối ưu hình ảnh.

source: CDN URL
vi: URL CDN

source: Public Domain
vi: Domain công khai

source: Public URL for R2 bucket. Required for CDN Worker deployment.
vi: URL công khai cho bucket R2. Bắt buộc để triển khai CDN Worker.

source: Use R2.dev subdomain (e.g., https://pub-xxx.r2.dev) or custom domain.
vi: Dùng subdomain R2.dev (ví dụ: https://pub-xxx.r2.dev) hoặc domain tùy chỉnh.

source: Enable CDN (Auto Avif/WebP & Optimization)
vi: Bật CDN (Tự động Avif/WebP & Tối ưu)

source: Replace media URLs with CDN URLs for optimized delivery.
vi: Thay thế URL media bằng URL CDN để phân phối tối ưu.

source: Worker Deployment
vi: Triển khai Worker

source: Deploy Cloudflare Worker for image transformation.
vi: Triển khai Cloudflare Worker để chuyển đổi hình ảnh.

source: Cloudflare API Token
vi: API Token Cloudflare

source: Create at: Cloudflare Dashboard → My Profile → API Tokens
vi: Tạo tại: Cloudflare Dashboard → My Profile → API Tokens

source: Required permissions: Workers Scripts, Workers R2, Zone, Zone Settings, DNS, Workers Routes, Cache Purge
vi: Quyền cần thiết: Workers Scripts, Workers R2, Zone, Zone Settings, DNS, Workers Routes, Cache Purge

source: API Token is required for Worker deployment and cache purging.
vi: API Token cần thiết để triển khai Worker và xóa cache.

source: Option A: Use R2 Custom Domain (Recommended)
vi: Tùy chọn A: Dùng R2 Custom Domain (Khuyến nghị)

source: Option B: Use Worker Route
vi: Tùy chọn B: Dùng Worker Route

source: Enter your desired CDN URL (e.g., https://cdn.yourdomain.com)
vi: Nhập URL CDN mong muốn (ví dụ: https://cdn.yourdomain.com)

source: Your custom domain pointing to the Worker. DNS record will be created automatically if not exists.
vi: Domain tùy chỉnh trỏ đến Worker. Bản ghi DNS sẽ được tạo tự động nếu chưa có.

source: What happens when you validate:
vi: Điều gì xảy ra khi xác thực:

source: If DNS record does not exist → Creates A record with proxy enabled
vi: Nếu bản ghi DNS không tồn tại → Tạo bản ghi A với proxy đã bật

source: If DNS record exists but proxy disabled → Shows warning with fix button
vi: Nếu bản ghi DNS tồn tại nhưng proxy tắt → Hiển thị cảnh báo với nút sửa

source: If DNS record exists with proxy → Ready to deploy!
vi: Nếu bản ghi DNS tồn tại với proxy → Sẵn sàng triển khai!

source: Requirements:
vi: Yêu cầu:

source: API Token with Zone (Read), DNS (Edit) permissions
vi: API Token với quyền Zone (Read), DNS (Edit)

source: Domain must be in your Cloudflare account
vi: Domain phải nằm trong tài khoản Cloudflare của bạn

source: Validate DNS
vi: Xác thực DNS

source: Click "Validate DNS" to check/create the DNS record automatically
vi: Nhấn "Xác thực DNS" để kiểm tra/tạo bản ghi DNS tự động

source: Click "Deploy Worker" to deploy and configure routes
vi: Nhấn "Triển khai Worker" để triển khai và cấu hình routes

source: How does automatic DNS setup work?
vi: Cài đặt DNS tự động hoạt động như thế nào?

source: Cloudflare will automatically create DNS record
vi: Cloudflare sẽ tự động tạo bản ghi DNS

source: Current:
vi: Hiện tại:

source: Automatic Setup (Recommended)
vi: Cài đặt tự động (Khuyến nghị)

source: Enter subdomain (e.g., <code>cdn.yourdomain.com</code>)
vi: Nhập subdomain (ví dụ: <code>cdn.yourdomain.com</code>)

source: Add DNS record: CNAME <code>cdn</code> to your Worker
vi: Thêm bản ghi DNS: CNAME <code>cdn</code> đến Worker

source: Configure Worker route
vi: Cấu hình Worker route

source: Bind R2 to Worker
vi: Liên kết R2 với Worker

source: Create Worker route: <code>cdn.yourdomain.com/*</code>
vi: Tạo Worker route: <code>cdn.yourdomain.com/*</code>

source: Deploy Worker
vi: Triển khai Worker

source: Remove Worker
vi: Gỡ Worker

source: Image Format
vi: Định dạng hình ảnh

source: Original
vi: Gốc

source: Keep original format (JPEG, PNG, GIF). No conversion, maximum compatibility. Larger file sizes.
vi: Giữ định dạng gốc (JPEG, PNG, GIF). Không chuyển đổi, tương thích tối đa. Kích thước tệp lớn hơn.

source: WebP (Recommended)
vi: WebP (Khuyến nghị)

source: 25-35% smaller than JPEG. Supported by 97%+ browsers. Best balance of compression and compatibility.
vi: Nhỏ hơn 25-35% so với JPEG. Được hỗ trợ bởi 97%+ trình duyệt. Cân bằng tốt nhất giữa nén và tương thích.

source: 50% smaller than JPEG. Best compression. Supported by 93%+ browsers. Falls back to WebP for older browsers.
vi: Nhỏ hơn 50% so với JPEG. Nén tốt nhất. Được hỗ trợ bởi 93%+ trình duyệt. Quay về WebP cho trình duyệt cũ.

source: Enable AVIF
vi: Bật AVIF

source: Serve AVIF format for supported browsers. Better compression than WebP.
vi: Phục vụ định dạng AVIF cho trình duyệt hỗ trợ. Nén tốt hơn WebP.

source: Image Quality
vi: Chất lượng hình ảnh

source: Quality
vi: Chất lượng

source: 1-100. Higher = better quality, larger files. Default: 85
vi: 1-100. Cao hơn = chất lượng tốt hơn, tệp lớn hơn. Mặc định: 85

source: 1-100 (default 85). Lower = smaller file, less quality.
vi: 1-100 (mặc định 85). Thấp hơn = tệp nhỏ hơn, chất lượng kém hơn.

source: Smart Sizes
vi: Kích thước thông minh

source: Auto-calculate responsive sizes. Increases Transformations usage.
vi: Tự động tính kích thước responsive. Tăng sử dụng Transformations.

source: Calculate optimal sizes attribute based on content width. Reduces bandwidth on mobile but increases Cloudflare Transformations cost.
vi: Tính thuộc tính sizes tối ưu dựa trên chiều rộng nội dung. Giảm băng thông trên di động nhưng tăng chi phí Cloudflare Transformations.

source: Content Max Width
vi: Chiều rộng nội dung tối đa

source: Maximum content area width in your theme. Used to calculate optimal image sizes.
vi: Chiều rộng vùng nội dung tối đa trong theme. Dùng để tính kích thước hình ảnh tối ưu.

source: Offload Settings
vi: Cài đặt Offload

source: Configure how media files are offloaded to R2 storage.
vi: Cấu hình cách chuyển tệp media lên lưu trữ R2.

source: Auto-Offload on Upload
vi: Tự động chuyển khi tải lên

source: Automatically offload media files to R2 when uploaded.
vi: Tự động chuyển tệp media lên R2 khi tải lên.

source: Keep Local Files
vi: Giữ tệp cục bộ

source: Keep local copies of files after offloading to R2. Disable to save disk space (files will be served from R2/CDN).
vi: Giữ bản sao cục bộ sau khi chuyển lên R2. Tắt để tiết kiệm dung lượng (tệp sẽ được phục vụ từ R2/CDN).

source: Sync Delete
vi: Đồng bộ xóa

source: When deleting media from WordPress, also delete from R2 storage. Disable to keep R2 copies as backup.
vi: Khi xóa media từ WordPress, cũng xóa từ lưu trữ R2. Tắt để giữ bản sao R2 làm backup.

source: Bulk Actions
vi: Thao tác hàng loạt

source: Manage bulk offload operations and monitor progress.
vi: Quản lý thao tác chuyển hàng loạt và theo dõi tiến trình.

source: Media Overview
vi: Tổng quan Media

source: Local / R2
vi: Cục bộ / R2

source: Pending Queue
vi: Hàng đợi

source: Failed Items
vi: Mục thất bại

source: R2 Offload Terminal
vi: Terminal Offload R2

source: Loading...
vi: Đang tải...

source: Actions
vi: Thao tác

source: Batch Size
vi: Kích thước batch

source: 10 files per batch
vi: 10 tệp mỗi batch

source: 25 files per batch
vi: 25 tệp mỗi batch

source: 50 files per batch
vi: 50 tệp mỗi batch

source: Number of files to process in each batch during bulk offload.
vi: Số tệp xử lý mỗi batch khi chuyển hàng loạt.

source: Offload All (%d)
vi: Chuyển tất cả (%d)

source: Restore All (%d)
vi: Khôi phục toàn bộ (%d)

source: Free Disk Space (%d)
vi: Dọn dẹp ổ đĩa (%d)

source: Retry Failed (%d)
vi: Thử lại thất bại (%d)

source: Cancel
vi: Hủy

source: Clear
vi: Xóa

source: Process Log
vi: Nhật ký xử lý

source: Ready. Click "Offload All Media" to start.
vi: Sẵn sàng. Nhấn "Chuyển tất cả Media" để bắt đầu.

source: System Info
vi: Thông tin hệ thống

source: System Information
vi: Thông tin hệ thống

source: System status and debug information for troubleshooting.
vi: Trạng thái hệ thống và thông tin debug để khắc phục sự cố.

source: Copy to Clipboard
vi: Sao chép vào clipboard

source: Copy this information when requesting support.
vi: Sao chép thông tin này khi yêu cầu hỗ trợ.

source: Debug Information
vi: Thông tin Debug

source: Plugin Version
vi: Phiên bản Plugin

source: WordPress Version
vi: Phiên bản WordPress

source: PHP Version
vi: Phiên bản PHP

source: PHP Memory Limit
vi: Giới hạn bộ nhớ PHP

source: Max Execution Time
vi: Thời gian thực thi tối đa

source: Unlimited
vi: Không giới hạn

source: cURL Extension
vi: Extension cURL

source: OpenSSL Extension
vi: Extension OpenSSL

source: R2 Status
vi: Trạng thái R2

source: Get Support
vi: Nhận hỗ trợ

source: Offloaded to R2
vi: Đã chuyển lên R2

source: Queued for offload
vi: Đang trong hàng đợi

source: Offload to R2
vi: Chuyển lên R2

source: Re-offload
vi: Chuyển lại

source: Restore to Local
vi: Khôi phục về cục bộ

source: Delete Local
vi: Xóa cục bộ

source: Download to Local
vi: Tải về cục bộ

source: Not available
vi: Không khả dụng

source: Offloaded successfully
vi: Đã chuyển thành công

source: R2 credentials not configured.
vi: Chưa cấu hình thông tin R2.

source: Could not determine file path
vi: Không thể xác định đường dẫn tệp

source: File not found
vi: Không tìm thấy tệp

source: File exceeds 70MB limit
vi: Tệp vượt quá giới hạn 70MB

source: Offload blocked by filter (cfr2_should_offload)
vi: Chuyển bị chặn bởi filter (cfr2_should_offload)

source: Attachment is not offloaded to R2
vi: Tệp đính kèm chưa được chuyển lên R2

source: No R2 key found
vi: Không tìm thấy key R2

source: Restored to local
vi: Đã khôi phục về cục bộ

source: No local files found to delete
vi: Không tìm thấy tệp cục bộ để xóa

source: No local files to delete
vi: Không có tệp cục bộ để xóa

source: Local files deleted (+%d thumbnails)
vi: Đã xóa tệp cục bộ (+%d thumbnails)

source: Files already exist locally
vi: Tệp đã tồn tại cục bộ

source: Missing file path or R2 key
vi: Thiếu đường dẫn tệp hoặc key R2

source: Failed to download main file: %s
vi: Không thể tải tệp chính: %s

source: Files restored to local (+%d thumbnails)
vi: Đã khôi phục tệp về cục bộ (+%d thumbnails)

source: Security check failed.
vi: Kiểm tra bảo mật thất bại.

source: Permission denied.
vi: Không có quyền truy cập.

source: No changes detected.
vi: Không phát hiện thay đổi.

source: Too many attempts. Wait 60 seconds.
vi: Quá nhiều lần thử. Đợi 60 giây.

source: CDN URL is required.
vi: Cần URL CDN.

source: Invalid CDN URL
vi: URL CDN không hợp lệ

source: Settings saved.
vi: Đã lưu cài đặt.

source: Failed to save settings. Please try again.
vi: Không thể lưu cài đặt. Vui lòng thử lại.

source: Connection successful!
vi: Kết nối thành công!

source: Connection successful
vi: Kết nối thành công

source: Too many requests. Please try again later.
vi: Quá nhiều yêu cầu. Vui lòng thử lại sau.

source: Invalid attachment ID.
vi: ID tệp đính kèm không hợp lệ.

source: %1$d files queued for %2$s.
vi: %1$d tệp đã được thêm vào hàng đợi để %2$s.

source: Offload
vi: Chuyển

source: Bulk offload cancelled.
vi: Đã hủy chuyển hàng loạt.

source: Bulk restore cancelled.
vi: Đã hủy khôi phục hàng loạt.

source: Bulk delete cancelled.
vi: Đã hủy xóa hàng loạt.

source: All items processed.
vi: Tất cả mục đã được xử lý.

source: All items restored.
vi: Tất cả mục đã được khôi phục.

source: All local files deleted.
vi: Đã xóa tất cả tệp cục bộ.

source: Operation cancelled.
vi: Thao tác đã bị hủy.

source: Operation completed.
vi: Thao tác đã hoàn thành.

source: Operation failed
vi: Thao tác thất bại

source: An error occurred during the operation.
vi: Đã xảy ra lỗi trong quá trình thao tác.

source: Progress
vi: Tiến trình

source: Elapsed Time:
vi: Thời gian đã qua:

source: Completed
vi: Hoàn thành

source: Unknown action
vi: Thao tác không xác định

source: File offloaded to R2 successfully.
vi: Đã chuyển tệp lên R2 thành công.

source: Offload failed.
vi: Chuyển thất bại.

source: File downloaded to local storage. Website continues serving from R2.
vi: Đã tải tệp về lưu trữ cục bộ. Website tiếp tục phục vụ từ R2.

source: Local file not found
vi: Không tìm thấy tệp cục bộ

source: Local files deleted successfully. Files remain on R2.
vi: Đã xóa tệp cục bộ thành công. Tệp vẫn còn trên R2.

source: Offloaded successfully!
vi: Đã chuyển thành công!

source: Unknown error
vi: Lỗi không xác định

source: An error occurred. Please try again.
vi: Đã xảy ra lỗi. Vui lòng thử lại.

source: Invalid item ID.
vi: ID mục không hợp lệ.

source: Could not cancel item. It may already be processing.
vi: Không thể hủy mục. Có thể đang được xử lý.

source: Item cancelled.
vi: Đã hủy mục.

source: Failed to queue item.
vi: Không thể thêm mục vào hàng đợi.

source: Item queued for retry.
vi: Đã thêm mục vào hàng đợi để thử lại.

source: %d pending items cancelled.
vi: Đã hủy %d mục đang chờ.

source: %d items queued for retry.
vi: Đã thêm %d mục vào hàng đợi để thử lại.

source: Activity log cleared.
vi: Đã xóa nhật ký hoạt động.

source: Please configure Cloudflare API Token first.
vi: Vui lòng cấu hình API Token Cloudflare trước.

source: R2 Bucket name is required. Please configure it in the Storage tab first.
vi: Cần tên Bucket R2. Vui lòng cấu hình trong tab Lưu trữ trước.

source: Worker deployed successfully!
vi: Đã triển khai Worker thành công!

source: Failed to upload Worker script: %s
vi: Không thể tải lên script Worker: %s

source: Failed to configure route
vi: Không thể cấu hình route

source: Worker removed.
vi: Đã gỡ Worker.

source: Worker deployed successfully
vi: Đã triển khai Worker thành công

source: Missing Cloudflare API Token or Account ID.
vi: Thiếu API Token hoặc Account ID Cloudflare.

source: Invalid API token
vi: API token không hợp lệ

source: Domain "%s" not found in your Cloudflare account
vi: Không tìm thấy domain "%s" trong tài khoản Cloudflare của bạn

source: Zone not found for domain: %s
vi: Không tìm thấy zone cho domain: %s

source: DNS record created for %s with Cloudflare proxy enabled.
vi: Đã tạo bản ghi DNS cho %s với proxy Cloudflare đã bật.

source: DNS record exists but Cloudflare proxy is DISABLED. Worker will NOT work without proxy.
vi: Bản ghi DNS tồn tại nhưng proxy Cloudflare CHƯA BẬT. Worker sẽ KHÔNG hoạt động nếu không có proxy.

source: Failed to create DNS record
vi: Không thể tạo bản ghi DNS

source: Missing zone or record ID.
vi: Thiếu zone hoặc record ID.

source: Proxy enabled successfully!
vi: Đã bật proxy thành công!

source: Failed to enable proxy.
vi: Không thể bật proxy.

source: Are you sure?
vi: Bạn có chắc không?

source: Delete local files? This cannot be undone. Files will remain on R2.
vi: Xóa tệp cục bộ? Không thể hoàn tác. Tệp vẫn còn trên R2.

source: Close
vi: Đóng

source: Retry All
vi: Thử lại tất cả

source: Clear All
vi: Xóa tất cả

source: Saving...
vi: Đang lưu...

source: MIME type "%s" is not allowed for offload
vi: Loại MIME "%s" không được phép chuyển

source: Deleted %d file(s) from R2
vi: Đã xóa %d tệp từ R2

source: Deleted local files (+%d thumbnails)
vi: Đã xóa tệp cục bộ (+%d thumbnails)

source: Missing %s
vi: Thiếu %s

source: This plugin requires PHP 7.4 or higher.
vi: Plugin này yêu cầu PHP 7.4 trở lên.

source: This plugin requires WordPress 6.0 or higher.
vi: Plugin này yêu cầu WordPress 6.0 trở lên.

source: List zones/domains
vi: Liệt kê zones/domains

source: Create/edit DNS records
vi: Tạo/sửa bản ghi DNS

source: Set <strong>Account Resources</strong>: Include your account
vi: Đặt <strong>Account Resources</strong>: Bao gồm tài khoản của bạn

source: Set <strong>Zone Resources</strong>: Include your domain
vi: Đặt <strong>Zone Resources</strong>: Bao gồm domain của bạn

source: Zone Resources must include your domain
vi: Zone Resources phải bao gồm domain của bạn

source: by
vi: bởi

source: You do not have permission to access this page.
vi: Bạn không có quyền truy cập trang này.

source: You need a custom domain to serve images via CDN with image transformations.
vi: Bạn cần domain tùy chỉnh để phục vụ hình ảnh qua CDN với chuyển đổi hình ảnh.

source: Offload WordPress media to Cloudflare R2 storage and serve via CDN with automatic image optimization (WebP/AVIF, resize, quality).
vi: Chuyển media WordPress lên lưu trữ Cloudflare R2 và phục vụ qua CDN với tối ưu hình ảnh tự động (WebP/AVIF, thay đổi kích thước, chất lượng).

source: Go to Bulk Actions
vi: Đi đến Thao tác hàng loạt

source: Disclaimer:
vi: Tuyên bố miễn trừ:
